Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: ཨོྃ་ཨུཏྟིཥྛ་ཧ་རི་པིང་ག་ལ་ལོ་ཧི་ཏཱ་ཀྵ། དེ་ཧི་ད་དཱ་པ་ཡ་ཧཱུཾ་སྥ་ཊ་སྥ་ཊ་སརྦ་བིགྷྞཱཾ་བི་ནཱ་ཤ་ཡ་སྭཱ་ཧཱ།
en: “ Oṁ , rise up, O tawny [flame] with red eyes! Give and cause to give! Hūṁ, phaṭ phaṭ! Destroy all the obstacles, svāhā!

source: འཇམ་དཔལ་འདི་ནི་མེའི་སྙིང་པོའི་མཆོག་ལས་ཐམས་ཅད་བྱེད་པ་འདོད་པ་ཐམས་ཅད་སྟེར་བར་བྱེད་པ་ཡིན་ཏེ
en: “This, O Mañjuśrī, is the supreme heart [mantra] of [the god of] fire that accomplishes all activities and fulfills all wishes. {13.2}

source: དང་པོ་རེ་ཞིག་སྒྲུབ་པ་པོས་མེའི་སྙིང་པོ་འདི་ལན་ཅིག་བཟླས་པས།
en: “At the beginning, the practitioner should offer into the fire three oblations of ghee,

source: སྲེག་བླུགས་གསུམ་གྱིས་མེ་ལ་སྦྱིན་སྲེག་བྱས་ནས་མེ་སྤྱན་དྲང་བར་འགྱུར་རོ། །
en: incanted each time with this heart mantra of fire.

source: དེ་ལྟར་རབ་ཏུ་སྦྱར་ན་ཞི་བ་དང་རྒྱས་པ་དང་། དྲག་པོའི་ལས་དག་ལ་ཡམ་ཤིང་རྣམ་པ་གསུམ་དུ་འགྱུར་ཏེ།
en: For someone engaged in this way in the performance of the pacifying, nourishing, or wrathful activities, there are prescribed three types of firewood, respectively. {13.3}

source: མྱ་ངན་མེད་ཤིང་ཞི་དོན་དུ། །རློན་པ་ཉིད་ནི་རབ་ཏུ་བསྔགས། །
en: “The sticks from the aśoka tree are for the activity of pacifying, Especially if they are moist with sap.

source: མཐོ་གང་འམ་ནི་ཁྲུ་གང་ཙམ། །སོར་གསུམ་སྲིད་དུ་བྱ་བ་ཡིན། །
en: The best ones are nine inches, a cubit, Or perhaps three fingers long. {13.4}

source: སྣུམ་པའི་རྣམ་པ་རབ་ཏུ་བསྔགས། །ཆོ་ག་འདི་ནི་བྱ་བ་ཡིན། །
en: “The ritual instructions specify That viscid sticks are the best.

source: བུ་ག་མེད་ཅིང་ནང་སྟོང་མིན། །
en: They should be without holes nor be hollow,

source: དེ་བཞིན་ནེ་ཙོའི་འདབ་མ་དང་། །
en: With the hue of a parrot’s plumage. {13.5}

source: ལྗང་དང་དཀར་བའི་ཁ་དོག་གམ། །ཁ་དོག་ནག་པ་སྤང་བར་བྱ། །
en: “One should avoid yellow, White, or black colors.

source: སྲིན་བུ་རྣམས་ཀྱིས་ཟོས་པའང་སྤང་། །བུ་ག་ཡོད་པའང་རྣམ་པར་བཟློག །
en: One should collect sticks without holes, Rejecting also those damaged by worms. {13.6}

source: གཞན་ཡང་ཁ་དོག་རབ་བསྔགས་མིན། །
en: “Sticks of other colors are not recommended.

source: ཐ་མ་ཉིད་ཀྱང་རྣམ་པར་སྤངས། །
en: One should avoid only sticks of the worst kind.

source: ཧ་ཅང་སྐམ་མིན་རློན་པའང་མིན། །
en: They should be not too dry and not too moist.

source: ཚིག་མིན་ལས་ནི་བརྩམ་པར་བྱ། །
en: Nor should one use scorched sticks. {13.7}

source: རུལ་བ་དང་ནི་ཡོ་བའང་མིན། །ཤིན་ཏུ་རིང་བའང་སྤང་བར་བྱ། །
en: “One should also avoid those that are Rotten, crooked, or too long.

source: དེ་ནས་མེ་ཐབ་བྱ་བ་ནི། །ཀུན་ནས་གྲུ་བཞིར་བྱ་བ་སྟེ། །
en: One should then prepare a fire pit, Rectangular on all sides. {13.8}

source: འོག་ཉིད་དུ་ཡང་བརྐོ་བ་ནི། །འབད་པས་ཁྲུ་ནི་བཞི་ཡི་ཚད། །
en: “One should carefully dig a pit To the depth of four cubits,

source: ཁྲུ་གསུམ་དང་ནི་ཁྲུ་གཉིས་དང་། །དེ་བཞིན་ཁྲུ་གཅིག་ཚད་དུ་བྱ། །
en: Or, alternatively, three cubits, two cubits, Or even one cubit. {13.9}

source: རྟག་ཏུ་སྲོག་ཆགས་སྤངས་པ་དང་། །བྱེ་མས་ལེགས་པར་སྦྱར་བ་གང་། །
en: “The pit should be free of living organisms And made of sand.

source: དེ་ནས་པད་འདྲའི་ལན་ཀན་ནི། །ཀུན་ནས་དཀྱིལ་འཁོར་འདྲ་བའོ། །
en: One should then prepare a lotus-shaped altar Encircling the pit all around. {13.10}

source: ཡང་ན་འབད་པས་ཟུར་བཞི་ཡང་། །དེ་བཞིན་ལན་ཀན་དབྱིབས་སུ་བྱ། །
en: “Or, one can carefully make An enclosure in the shape of a square,

source: རྡོ་རྗེའི་རྣམ་པ་འདྲ་བ་ཡི། །རྩེ་མོ་གཉིས་སུའང་རྩེ་གསུམ་བྱ། །
en: With corners in the shape of vajras, Both ends of which are three-pronged. {13.11}

source: མེ་ཐབ་ཀྱི་ནི་ཐད་ཀ་ལ། །ཁྲུ་གཉིས་ཐད་ཀར་བྱ་བ་ཡིན། །
en: “Inside this fire pit one should prepare A flat, two-cubit area.

source: གཙང་དང་དེ་བཞིན་གསལ་བའི་གནས། །
en: One who is well prepared should perform the homa In a pure, cleanly swept place, {13.12}

source: ཆུ་ཀླུང་དེ་བཞིན་ཆུ་དབུས་དང་། །ཤིང་གཅིག་གི་ནི་ཕྱོགས་དག་དང་། །
en: “On a well-chosen riverbank, Or in a lonely spot on dry land,

source: དུར་ཁྲོད་དང་ནི་ཁང་སྟོང་དུ། །སྦྱིན་སྲེག་ལེགས་པར་ཡང་དག་བརྩམ། །དེ་བཞིན་རི་བོའི་རྩེ་དག་ཏུའོ། །
en: A charnel ground, an empty dwelling, Or on a mountaintop. {13.13}

source: རྟག་ཏུ་ལྷ་ཁང་སྟོང་པ་དང་། །དགོན་པ་ཆེན་པོའང་དེ་བཞིན་ནོ། །
en: “Also, one can always do this in an empty temple Or a big forest.

source: གང་ཡང་སྒྲུབ་པའི་ཕྱོགས་དག་ཏུ། །གང་ཟག་མཆོག་གིས་རབ་གསུངས་པ། །
en: Places that have been recommended by the most eminent of men As suitable for successful practice {13.14}

source: སྦྱིན་སྲེག་གནས་ནི་ཐམས་ཅད་ལ། །གནས་དེ་དག་ནི་ཐམས་ཅད་གསུངས། །
en: “Have also been described as suitable in every respect For the performance of the homa rite.

source: ཀུ་ཤའི་ཁྲེས་ནི་ཁྲུ་གང་ཙམ། །དེ་ལ་འདུག་པར་བྱས་ནས་ནི། །
en: One who knows the mantra, Having sat on a bundle of kuśa grass {13.15}

source: སྔགས་ཤེས་དེར་ནི་སྦྱིན་སྲེག་ལས། །ཁྱད་པར་དུ་ཡང་བྱ་བ་ཡིན། །
en: “One cubit in size, Should perform the homa rite in a particular way.

source: གནས་དེ་དག་ལ་འདུག་ན་ནི། །མྱུར་དུ་འགྲུབ་པར་ཐེ་ཚོམ་མེད། །
en: If one remains in such places, Accomplishment will be swift, have no doubt. {13.16}

source: ཤར་དང་བྱང་དུ་བལྟས་པས་ཀྱང་། །ཞི་བ་དང་ནི་རྒྱས་པར་བྱ། །
en: “For the activities of pacifying and enriching One should sit facing east or north.

source: ལྷོར་བལྟས་ནས་ནི་དྲག་པོའི་ལས། །སྔགས་པས་དེ་ནི་སྤང་བར་བྱ། །
en: Violent activities, however, associated with the south, The mantra practitioner should avoid. {13.17}

source: ཤར་དུ་བལྟས་པས་ཞི་བ་འགྲུབ། །
en: “When one faces east, the accomplishment will be of a peaceful kind;

source: བྱང་དུ་བལྟས་པས་རྒྱས་པའོ། །
en: When it is the north, it will be of an enriching kind.

source: འདི་ཡིས་སྔགས་པ་དུས་རྟག་ཏུ། །སྔགས་ཀྱི་ངོ་བོ་ཡང་དག་བརྩམ། །
en: One should always begin the mantra recitation Facing these directions. {13.18}

source: བིལ་བ་པླག་ཤ་ནྱ་གྲོ་དྷས། །རྒྱས་པའི་ལས་ནི་ཡོངས་སུ་བྱ། །
en: “One should perform rites of enriching Using sticks of the bilva, mango, waved-leaf fig, or banyan tree.

source: མངོན་སྤྱོད་ཤིང་ལས་བྱ་བ་ནི། །དཀར་དང་ཚྭ་དང་སྐྱུར་དང་རྣོ། །དེ་དག་ཐམས་ཅད་སྤང་བྱ་སྟེ། །ཐུབ་པ་རྣམས་ཀྱིས་རྟག་ཏུ་བཀག །
en: Sticks used for violent rites Should be dry, pungent, sour, or bitter. {13.19} “All these that are meant for violent rites should be avoided, As they have been prohibited by the sages.

source: ཞི་དང་རྒྱས་པའི་ལས་ལ་ནི། །ཤིང་རློན་དག་ནི་རབ་ཏུ་བསྔགས། །
en: In the rites of pacifying and enriching Sticks moist with sap are said to be the best. {13.20}

source: དྲག་པོའི་ལས་ལ་ཤིང་སྐམ་སྟེ། །ཐུབ་པ་རྣམས་ཀྱིས་རྟག་ཏུ་སྤངས། །
en: “Dry sticks, used in violent rites, Should be avoided, according to the sages;

source: ཡམ་ཤིང་དེ་དག་མེད་ན་ནི། །ཐ་མལ་ཤིང་དག་ཀུན་དུ་བརྟག །
en: They can, however, be used If the right type is not available. {13.21}

source: གཉི་གའི་རྩེ་མོར་བྱ་བ་ནི། །ཀུ་ཤས་ཀུན་དུ་ཡང་དག་དཀྲི། །
en: “Around the fire pit one should spread An array of kuśa grass blades that are pointed at both ends,

source: སྔོ་དང་སྣུམ་པ་འདྲ་བ་དང་། །རྨ་བྱའི་མགྲིན་པ་འདྲ་བ་དང་། །
en: Using blades that have a glossy, yellow-green color, Like a peacock’s neck. {13.22}

source: དེ་འདྲའི་ཀུ་ཤས་རྟག་ཏུ་ནི། །ཞི་བ་དང་ནི་རྒྱས་པ་བྱ། །
en: “One should always use blades of this kind In rites of pacifying and enriching,

source: མརྒད་རྣམ་པ་འདྲ་བ་དང་། །རྩྭ་སྐམ་གྱིས་ནི་རྟག་ཏུ་ཡང་། །
en: And dried blades of other grasses Of an emerald color {13.23}

source: སྡིག་པའི་ལས་རྣམས་བྱ་བ་ཡིན། །འདིར་ནི་ཐུབ་པ་མཆོག་གིས་བཀག །
en: “In rites of evil activity; As for these, though, they are forbidden by the best of victors.

source: དྲི་མེད་ཆུ་ནི་ཡོངས་དག་པ། །སྲོག་ཆགས་དག་གིས་རྟག་སྤངས་པ། །
en: One should take pure and clean water, Which always must be free of worms, {13.24}

source: དེས་ནི་ཀུན་ནས་གཏོར་བྱས་ནས། །གཡས་ཕྱོགས་སུ་ནི་བསྐོར་བྱས་ཏེ། །
en: “And circumambulate the fire pit clockwise, Sprinkling it all around.

source: སྡོམ་བརྩོན་གྱིས་ནི་མེ་སྦར་བྱ། །ཆོ་ག་ཇི་བཞིན་ཉེ་རེག་བྱ། །
en: One should then light the fire, wholly absorbed in this task, Having performed the ablutions according to procedure. {13.25}

source: གཙང་བའི་རྩྭ་ཡི་རྩ་བས་ནི། །མེ་སྒྲོན་ཚད་དང་ལྡན་བྱས་ནས། །
en: “With clean roots of grass, One should prepare a torch of the right size,

source: དེ་ནས་ཆང་པར་བཅངས་ནས་ནི། །འབད་པས་མེ་ནི་སྤར་བར་བྱ། །
en: Then take it in hand And carefully kindle the fire. {13.26}

source: ཁ་ཡི་རླུང་གིས་མི་བྱ་སྟེ། །རྟག་ཏུ་གོས་ཀྱི་མཐས་ཀྱང་མིན། །ཤམ་ཐབས་བླ་གོས་རྣམ་པར་སྤངས། །གོས་གཞན་དག་ནི་བཀག་མ་ཡིན། །
en: “One should not blow at the kindling with one’s mouth, Nor fan the fire with the edge of one’s garment, Such as the undergarment or the upper garment, But there is no restriction on other clothes. {13.27}

source: ཤིན་ཏུ་དྲག་པས་དེ་མི་བྱ། །གནོད་པར་དགའ་བའི་མ་ཡིན་ན། །
en: “Nor should one fan the fire with one’s hand, Or risk putting it out by being overzealous.

source: རླུང་ཡབ་གཙང་དང་དེ་བཞིན་གོས། །ལོ་མས་ཀྱང་ནི་རླུང་ཡབ་བྱ། །
en: One should fan it with a pure frond of a palm, Or perhaps a clean cloth or leaf. {13.28}

source: རླུང་གིས་ཁྱད་དུ་མི་གསོད་པ། །མེ་ནི་རབ་ཏུ་སད་བྱས་ནས། །
en: “When the fire has been kindled, Fanned with the wind generated as described,

source: སྔགས་ཤེས་པས་ནི་མེ་སྦར་ཏེ། །སྦྱིན་སྲེག་དོན་དུ་ལེགས་མཉམ་གཞག །
en: The knower of mantra should let it blaze And be well focused on the homa. {13.29}

source: ལག་པ་དེ་ནི་གཡོན་པ་ཡིས། །ལན་གསུམ་བར་དུ་ཆུས་གཏོར་ནས། །
en: “One should then sprinkle it three times, Using one’s left hand.

source: དེར་ནི་བ་ཡི་མར་གྱིས་ནི། །སྲེག་བླུགས་གསུམ་ནི་དེས་སྦྱིན་བྱ། །
en: Then one should offer three oblations, Using for this purpose clarified cow’s butter. {13.30}

source: དེ་ནས་ཀྱང་ནི་ཕྱག་བྱ་སྟེ། །སངས་རྒྱས་ཀུན་དང་སྐྱོབ་པ་དང་། །རང་སྔགས་སྔགས་ཀྱི་མགོན་པོ་ལ། །དེ་ནས་ཅི་འདོད་ཕྱག་བྱའོ། །
en: “One should then bow to All the buddhas, the protectors, And salute also, as seems fit, The mantra lord of one’s personal mantra. {13.31}

source: དེ་ཚེ་མེ་ཡི་སྙིང་པོ་ཡིས། །སྔགས་ཀྱིས་ལན་བདུན་རྟག་བཟླས་པའི། །དྲི་ཞིམ་མེ་ཏོག་དག་གིས་ནི། །སྡོམ་བརྩོན་མེ་ནི་སྤྱན་དྲང་བྱ། །
en: “Then, wholly dedicated to the task, One should invite the god of fire using fragrant flowers, Always incanted seven times With the heart mantra of fire. {13.32}

source: སྔགས་ཤེས་རྟག་ཏུ་སྤྱན་དྲངས་ནས། །མཁས་པས་གནས་ནི་སྦྱིན་པར་བྱ། །
en: “A wise practitioner, a knower of the mantra, Should summon him and offer him a place.

source: གདན་དང་གནས་ནི་སྦྱིན་བྱེད་ནའང་། །དེ་ཉིད་སྔགས་ཡིན་གཞན་པས་མིན། །
en: One should offer him a seat With the same heart mantra and no other. {13.33}

source: ཞོ་དང་མར་གྱིས་སྦགས་པ་དང་། །སྦྲང་རྩིས་སྦགས་པའི་ཡམ་ཤིང་གིས། །རྒྱས་པའི་ལས་ནི་བྱ་བའི་ཕྱིར། །སྔགས་ཀྱིས་ཀུན་དུ་སྦྱིན་སྲེག་བྱ། །
en: “In order to worship the god of fire One should offer three oblations of firewood sticks Covered in curds with ghee and smeared with honey, Performing the rite complete with the mantra. {13.34}

source: མར་དང་སྦྲང་རྩིར་ལྡན་པ་འམ། །ཡང་ན་ཞོ་དང་ལྡན་པ་ཡི། །ཡམ་ཤིང་རྫས་དང་ལྡན་པ་ཡིས། །གཉི་ག་ལ་གནས་དེ་ཚེ་བྱ། །
en: “One should, at that time, Smear both ends of the sticks with these substances, Applying ghee and honey, And mixing it with curds. {13.35}

source: སྟོང་ངམ་ཡང་ན་འབུམ་མམ་ནི། །ཡང་ན་བརྒྱ་རྩ་བརྒྱད་དུ་བརྟག །
en: “One can perform this 1000, 100,000, or 108 times.

source: དེ་ཚེ་སྔགས་པས་སྔགས་བཟུང་ནས། །ལན་རེ་བཟླས་ཤིང་མེ་ལ་དོར། །
en: If one is a practitioner of a secret mantra, One should pronounce it once for each oblation cast into the fire. {13.36}

source: འབར་བའི་མེ་ཡི་ཕྲེང་བ་འམ། །དེ་བཞིན་མེ་ལྕེ་གཅིག་གྱུར་ལ། །ཞི་བའི་ལས་ཀྱི་སྦྱིན་སྲེག་བྱ། །
en: “When performing peaceful rites, The fire should form a circle, Or a single tongue of flame.

source: དུད་པ་མེད་ལ་རྒྱས་པའང་བྱ། །
en: For the rites of enrichment, it should be smokeless. {13.37}

source: དུད་བཅས་དྲག་པོའི་ལས་ལ་བྱ། །དེ་ནི་རྒྱལ་བས་སྨད་ཅིང་སྤངས། །
en: “The fire should be smoky for rites of the violent type, Described by the victorious ones as forbidden.

source: གལ་ཏེ་མེ་ནི་མདོག་ལྡན་ན། །སྦྱིན་སྲེག་ལས་ནི་རབ་ཏུ་སྦྱར། །
en: If the fire has a color, Its color is associated with a respective oblatory activity. {13.38}

source: ཞི་ལ་ཁ་དོག་དཀར་པོ་ནི། །རྒྱལ་བ་མཆོག་གིས་རྟག་ཏུ་བསྔགས། །
en: “If this activity is peaceful, a fire that is white in color Has always been praised by the victorious ones as the best.

source: གལ་ཏེ་མེ་དཀར་སྦྱིན་སྲེག་བྱས། །དེར་ནི་སྔགས་རྣམས་འགྲུབ་པར་འགྱུར། །
en: If one offers into a white fire, The [peaceful] mantras will be successful. {13.39}

source: དེ་བཞིན་རྟག་ཏུ་མདོག་དམར་ལ། །རྒྱས་པ་འགྲུབ་པར་འདོད་པ་ཡིན། །
en: “The color red will always guarantee Accomplishment in the rites of enrichment.

source: གནག་དང་དུ་བའི་ཁ་དོག་དང་། །སེར་སྐྱ་ལ་ནི་སྡིག་ལྡན་ལས། །
en: If the fire is black and the smoke is brown, Violent rites will be successful. {13.40}

source: ཁ་དོག་རྣམ་གསུམ་བསྟན་པས་ནི། །རྣམ་གསུམ་གྲུབ་པ་འདི་དག་ཡིན། །
en: “There are thus three types of accomplishment Associated with the three colors.

source: མདོག་གཞན་སྤྲིན་གྱི་ཁ་དོག་གམ། །རྣམ་པ་སྣ་ཚོགས་མདོག་ལྡན་པ། །
en: The fire may also have another color, such as the color of a cloud, And may appear in different forms. {13.41}

source: ས་སྟེང་འདི་ལ་སྔགས་རྣམས་ནི། །གྲུབ་པ་ཡོད་པ་མ་ཡིན་ནོ། །
en: “When the fire is like this, The mantras cannot possibly succeed.

source: དེ་འདྲའི་ཁ་དོག་འདྲ་བ་འམ། །རྣམ་པ་སྣ་ཚོགས་མདོག་ལྡན་པའི། །མེ་ནི་འབར་བ་དེ་མཐོང་ན། །ལས་ཀྱི་སྦྱོར་བའང་བརྩམ་པར་བྱ། །
en: When seeing the fire blazing With this color {13.42} “Or with various [other undesirable] colors and forms, One should begin the rite once again.

source: གལ་ཏེ་སྔགས་ནི་གྲུབ་འདོད་ན། །ཕྱི་རོལ་མེ་ནི་སྦར་བར་བྱ། །
en: If one desires the mantra to succeed, One must perform the recitation again, {13.43}

source: ཆོ་ག་མཐོང་བའི་ལས་ཀྱིས་ནི། །ཕྱིར་ཡང་སྦྱིན་སྲེག་རབ་ཏུ་བྱ། །
en: “And do the homa rite once again Following the established ritual procedure.

source: མེ་ཡི་སྔགས་ནི་ཟློས་པ་ཡིས། །གཤེགས་གསོལ་སྤྱན་དྲང་ཉིད་ཀྱང་བྱ། །
en: To invoke or dismiss the deity, One should pronounce the mantra of fire {13.44}

source: དཀྱིལ་འཁོར་འདིར་ནི་ཆོ་ག་བཞིན། །སྔར་ནི་རབ་ཏུ་བརྟགས་པ་ཡིས། །
en: “Within the circle prepared beforehand, Following the right procedure.

source: དེ་ཉིད་ཀྱིས་ནི་སྦྱིན་སྲེག་བྱ། །གཤེགས་གསོལ་སྤྱན་དྲང་ལ་སོགས་པའང་། །
en: Employing this mantra, one should perform the homa Complete with the rites of invoking and dismissing the deity. {13.45}

source: དེ་ཉིད་ཀྱི་ནི་ལས་དག་གིས། །ལས་རྣམས་ཐམས་ཅད་ཉིད་ཀྱང་བྱ། །
en: “Based on this particular rite, One can accomplish any rite.

source: མེ་ཡི་ལས་དང་དེ་བཞིན་གཟུགས། །རས་རིས་མདུན་དུ་བརྩམ་བྱས་ན། །
en: One should commence such fire observances In front of the painting. {13.46}

source: དེར་ནི་སྔགས་རྣམས་འགྲུབ་འགྱུར་ཞེས། །སྔོན་གྱི་བདེ་གཤེགས་རྣམས་ཀྱིས་གསུངས། །
en: “One’s mantras will then be successful, As formerly declared by the tathāgatas.

source: རྒྱལ་བས་བསྔགས་པའི་ལས་རྣམས་དག །དེར་ནི་རྣམ་པ་ཀུན་དུ་བྱ། །
en: One should not perform just any activities, however, But only those praised by the victorious ones. {13.47}

source: སྡིག་པ་དག་ནི་ཁྱད་པར་དུ། །གང་ཡང་རྒྱལ་བས་སྨད་པ་དང་། །འཇིག་རྟེན་འགྲོ་བས་སྨད་པ་དག །གཞན་གྱིས་སྨད་པའང་བྱ་བ་མིན། །
en: “Thus, one should not perform other activities, Especially the evil ones Censured by the victorious ones And forbidden and reviled by the world. {13.48}

source: འཁོར་ལོས་སྒྱུར་བཟང་ཉིད་དང་ནི། །བྱང་ཆུབ་སེམས་དཔའི་ས་འཐོབ་དང་། །
en: “One will become either a universal emperor, Or a bodhisattva protecting the earth.

source: དེ་བཞིན་མངོན་ཤེས་ལྔ་འཐོབ་དང་། །དེ་ནས་ལྷ་ཉིད་ཐོབ་པའོ། །
en: One will attain the five superknowledges, Or the state of a god. {13.49}

source: རས་རིས་ལ་རྟག་བརྩོན་ཞིང་གཤེགས། །སྦྱིན་སྲེག་ལས་ལ་འཇིགས་མེད་དང་། །
en: “One who always applies the appropriate knowledge of the painting And is confident about the rite of the homa

source: ས་འོག་གི་ནི་བདག་པོ་འམ། །ཡང་ན་བར་སྣང་སྤྱོད་པར་འགྱུར། །
en: Will become the master of subterranean paradises And also be able to travel in the sky. {13.50}

source: ས་བདག་ལྷ་དང་གནོད་སྦྱིན་ཉིད། །རྟག་ཏུ་གནོད་སྦྱིན་མོ་འགུགས་བྱེད། །
en: “One will be able to change into an earth god or a yakṣa Who always attracts yakṣa maidens.

source: རྒྱལ་སྲིད་བདག་པོ་ཉིད་དང་ནི། །ཡུལ་ཉིད་དང་ནི་གྲོང་དག་དང་། །
en: One may become the ruler of a kingdom, Or a district, or perhaps the head of a village. {13.51}

source: རིག་པ་འཛིན་དང་ལྷ་མིན་ཉིད། །སེམས་ཅན་ཐམས་ཅད་དབང་དུ་བྱེད། །
en: “One may at will become a vidyādhara or an asura With the power to enthrall all beings.

source: བདག་ཉིད་ཆེ་དང་སེམས་ཅན་ཆེ། །འབྱུང་པོ་རྣམས་ནི་འགུགས་པར་བྱེད། །
en: One will be able to summon the spirits, As well as the great and noble beings. {13.52}

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེ། །ས་བཅུ་ལ་ནི་ཡང་དག་གནས། །སྦྱིན་སྲེག་ལས་ཀྱིས་འགུགས་བྱེད་ན། །ས་སྟེང་མི་རྣམས་སྨོས་ཅི་དགོས། །
en: “By means of this rite of homa, One will be able to summon the bodhisattvas, The great beings who abide on any of the ten levels, Not to mention ordinary humans on this earth. {13.53}

source: སྡེ་དཔོན་དག་དང་དེ་བཞིན་དུ། །ཁྱད་པར་འཇིག་རྟེན་དབང་ཕྱུག་འགྱུར། །
en: “One may become a general of an army, Or someone of exceptionally great might in this world.

source: དབང་འགྱུར་ཅིག་ཅར་འབྱུང་པོ་ཀུན། །དེ་བཞིན་མི་ཡི་དབང་པོ་ཉིད། །
en: One may control all the spirits And, likewise, become a lord of men. {13.54}

source: སེམས་ཅན་ཀུན་ལ་དབང་དོན་དང་། །ཡང་ན་རྒྱལ་པོ་དབང་དུ་འགྱུར། །
en: “Whether it is for the sake of enthralling all beings, Or becoming the king of men on earth,

source: དེ་བཞིན་རྟག་ཏུ་ལས་ཀུན་ལ། །སྦྱིན་སྲེག་གིས་ནི་ཀུན་དུ་བྱ། །
en: One should always include, with every activity, A complete rite of homa. {13.55}

source: ཐམས་ཅད་ཀུན་ལ་བརྩོན་བདག་ཉིད། །ལས་ཀུན་ལས་ནི་བསྟེན་བྱས་ན། །
en: “One should practice all the activities With complete dedication and in full;

source: དེ་ནི་ངེས་པར་འགྲུབ་འགྱུར་ཏེ། །ལས་དགེའི་དོན་ནི་དམ་པ་ཡིན། །
en: The supreme activity will then be successful And will serve the highest purpose. {13.56}

source: བར་མ་ཉིད་ཀྱང་འགྲུབ་པར་འགྱུར། །ཐ་མའི་ལས་ཀྱང་དེ་བཞིན་ནོ། །
en: “So too will the activities of the medium And the lowest type be successful,

source: རྫས་རྣམས་དག་ནི་དེ་བཞིན་དུ། །གྲུབ་དང་ལྡན་པའང་རྣམ་པ་གསུམ། །
en: And one will also obtain all the relevant power substances. Again, as has been said, the accomplishment can be of three types. {13.57}

source: འབྲས་དང་བཅས་པར་གྲུབ་སྣང་སྟེ། །སྦྱིན་སྲེག་ལས་ལ་རབ་ཏུ་བསྟན། །
en: “When the rite of homa is performed, One’s accomplishment will be rich in results.

source: ཕྱག་རྒྱ་གཙུག་ཕུད་ལྔ་བཅིངས་ནས། །སྔགས་ཀྱང་སྐྲ་ཅན་མས་བྱས་ན། །
en: One should form the five-crested mudrā And say the mantra of Keśinī. {13.58}

source: ལས་རྣམས་ཀུན་ནི་བྱ་བ་དང་། །སྔགས་པས་བདག་ཉིད་བསྲུང་བ་བྱ། །
en: “One should perform all activities, Having first performed the rite of self-protection.

source: སྦྱིན་སྲེག་ལས་ལ་རབ་འཇུག་པས། །དེ་ནས་སྔགས་འདི་བརྗོད་པར་བྱ། །
en: When engaging in the rite of homa, One should recite the following mantra.

source: བདུན་ནམ་བརྒྱད་དུ་བཟླས་པ་ཡིས། །ལས་འདི་ལ་ནི་རྟག་ཏུ་བྱ། །
en: This mantra should always be repeated, In this rite, seven or eight times. {13.59}

source: ན་མཿསརྦ་བུད་དྷཱ་བོ་དྷི་སཏྭཱ་ནཱཾ།
en: “Homage to all the buddhas and bodhisattvas, the perfect teachers.

source: ཨ་པྲ་ཏི་ཧ་ཏ་ག་ཏིཾ་ག་ཏཱ་ནཱཾ། ཏདྱ་ཐཱ། ཨོྃ་ཛྭ་ལ་ཏིཥྛ་ཧཱུཾ་རུ་རུ་བི་ཤྭ་སཾ་བྷ་བ་སཾ་བྷ་བེ་སྭཱ་ཧཱ།
en: “ Oṁ , burn! Remain, hūṁ! Ru ru , you from whom all things arise! You who are the origin, svāhā! {13.60}

source: སྔགས་ཀྱི་སྦྱོར་བ་འདི་ཡིས་ནི། །ཡང་དང་ཡང་དུ་ཤིང་ལ་བཟླ། །
en: “Using this mantra method, One should thoroughly recite again and again.

source: གཉིས་སམ་བདུན་དུ་བཟླས་པ་ཡིས། །སྔགས་རིག་དེས་ནི་སྦྱིན་སྲེག་བྱ། །
en: A mantra adept, having thus recited twice or seven times, Should offer oblations into the fire. {13.61}

source: མེ་ཏོག་བདུག་པ་དྲི་ཡང་རུང་། །མ་ལུས་ཐམས་ཅད་དག་དང་ནི། །ཆུ་ལ་སྔགས་རྣམས་བཟླས་པ་ཡང་། །འདི་ཉིད་ཀྱིས་ནི་སྦྱིན་པར་བྱ། །
en: “Using water incanted with this mantra, One should sprinkle Flowers, incense, perfume, And everything all around. {13.62}

source: ལས་རྣམས་ཀུན་གྱི་རྒྱུ་ཡི་ཕྱིར། །དེ་ནས་ཆོ་ག་བརྩམ་པར་བྱ། །
en: “One should then commence all activities According to procedure.

source: ལས་རྣམས་དག་ནི་ཐམས་ཅད་ལ། །སྔ་མའི་སྦྱོར་བ་ཉིད་ཀྱིས་བྱ། །
en: In all one’s activities one should apply The previously described method. {13.63}

source: སྔ་མའི་གཙུག་པུད་ལྔ་བཅིངས་ཏེ། །ཕྱག་རྒྱ་ཆེན་པོ་གྲགས་ལྡན་མ། །སྔ་མའི་གཙུག་པུད་ལྔ་བཅིངས་བྱ། །སྐྲ་ཅན་མ་ཉིད་རབ་བཟླས་པས། །དེས་ན་སྲུང་བ་བྱེད་པར་འགྱུར། །
en: “Having formed the great mudrā— The famed five-crested — One should do the protection rite And then continually recite the mantra of Keśinī. {13.64}

source: གྲུབ་པའི་རྒྱུ་ལ་འཇིགས་མེད་པས། །ལས་རྣམས་ཐམས་ཅད་བརྩམ་པར་བྱ། །
en: “One should embark on all activities Confident about the causes of accomplishment.

source: གལ་ཏེ་ལ་ཉེ་བཟང་མཐོང་བའམ། །རྟག་ཏུ་དགེ་བའི་སྒྲ་ཐོས་ན། །
en: If favorable signs are seen And beautiful sounds continuously heard, {13.65}

source: དེ་ལ་སྔགས་ནི་དོན་ཡོད་དེ། །ཇི་ལྟར་འདོད་བཞིན་མཆོག་སྩོལ་འགྱུར། །
en: “One’s mantras will certainly produce results By fulfilling the wished-for boons.

source: དང་པོའི་ལས་ལ་རབ་སྦྱོར་དང་། །སྔགས་ཀྱི་རྒྱུ་ལ་རབ་འཇུག་ན། །
en: When first applying the activities And engaging with mantra—the cause— {13.66}

source: ཐམས་ཅད་འབྲས་བུ་བཅས་པ་དང་། །དེ་ལ་གྲུབ་པར་བརྗོད་པ་ཡིན། །
en: “The accomplishment of such activities Will be complete and rich in results.

source: རྒྱལ་སྒྲ་རྔ་ནི་པ་ཊ་ཧ། །རྔ་བོ་ཆེ་ཡི་སྒྲ་དག་ནི། །
en: The cries of ‘Victory!’ will be heard, Along with the sounds of large and small kettledrums. {13.67}

source: བརྩོན་བྱས་གྲུབ་པ་མ་ལུས་འགྱུར། །སྦྱིན་སྲེག་ལས་ལ་ཡང་དག་བསྟེན། །
en: “Accomplishment is always said to follow, If one relies on the rite of homa.

source: གཞན་ཡང་ལ་ཉེ་བཟང་པོ་དང་། །འདབ་ཆགས་དགེ་བའི་སྒྲ་དག་དང་། །
en: Other favorable signs may also be seen Or the beautiful sounds of birds heard. {13.68}

source: རྣམ་པ་སྣ་ཚོགས་ངེས་པའི་སྒྲ། །རྒྱལ་བ་རྣམས་ཀྱིས་བསྔགས་པ་དང་། །
en: “Various kinds of sounds may be heard, Whose meanings have been described by the victorious ones—

source: བཀྲ་ཤིས་བཟང་པོ་རབ་བསྔགས་དང་། །རྣམ་པ་སྣ་ཚོགས་ཡིད་འོང་སྒྲ། །
en: Many kinds of exquisite sounds, Divine, auspicious, and pleasing to the mind. {13.69}

source: གདུགས་དང་རྒྱལ་མཚན་བ་དན་དང་། །བུད་མེད་རྒྱན་གྱིས་བརྒྱན་པ་དང་། །དེ་བཞིན་མཆོད་ཡོན་བུམ་པ་གང་། །མཐོང་ན་འགྲུབ་པའི་རྒྱུ་རྣམས་ཡིན། །
en: “Parasols, banners, and flags may be seen, Along with women bedecked in jewelry, And likewise vases full of offerings— Seeing them is a sign of accomplishment. {13.70}

source: རྣམ་པ་དུ་མའི་ཁ་དོག་གམ། །འཇིག་རྟེན་གྱིས་མཆོད་རབ་བསྔགས་པ། །
en: “They are all of many forms and colors, Praised and venerated by the world.

source: དེ་དག་མཐོང་ན་འགྲུབ་འགྱུར་བ། །སྔགས་རྣམས་དུ་མའི་སྤྱོད་ཡུལ་ཡིན། །
en: When they are perceived, The mantras, with their different applications, will be successful. {13.71}

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་ལས། འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་བཅུ་གསུམ་པ་སྟེ། སྦྱིན་སྲེག་གི་ཆོ་ག་རབ་འབྱམ་རྫོགས་སོ།། །།
en: This concludes the detailed thirteenth chapter in “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་གཞན་ཡང་གནས་གཙང་མའི་གཞལ་མེད་ཁང་ལ་གཟིགས་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Then Lord Śākyamuni again directed his gaze at the realm of the Pure Abode and said this to Mañjuśrī, the divine youth:

source: འཇམ་དཔལ་ཁྱོད་ཀྱི་གསང་བའི་རིག་པ་ཡོད་དེ། སྔགས་ཐམས་ཅད་ཀྱི་སྒྲུབ་པ་པོའི་ཐབས།
en: “There is, O Mañjuśrī, a secret vidyā mantra of yours that accomplishes all mantras.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཡང་དག་པར་རྗེས་སུ་གནང་བ། ཆོས་ཀྱི་མཛོད་ལས་བྱུང་བ། ཆོས་ཀྱི་སྤྲིན་གྱི་རྗེས་སུ་ཞུགས་པ།
en: It was granted by the tathāgatas, arose from the treasury of their teachings, belongs to the ‘Cloud of Dharma,’

source: ནམ་མཁའི་ངོ་བོ་ཉིད་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྔགས་ཐམས་ཅད་ཀྱི་མངའ་བདག་ཤིན་ཏུ་གཙོ་བོར་གྱུར་པ། གཞོན་ནུ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་བརྗོད་དེ
en: and is of the essence of the sky. This vidyā is the supreme lord of all mundane and supramundane mantras, just like the divine youth is the lord of all beings.

source: ཤིན་ཏུ་གཙོ་བོར་གྱུར་ཅིང་དམ་པ་ཡིན་ལ། ལྷ་དང་མི་རྣམས་ཀྱི་སྐྱེས་བུ་ཁྱུ་མཆོག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡིན་ནོ། །
en: This lord is described as a tathāgata, the supreme and the most excellent.

source: གཞོན་ནུ་དེ་བཞིན་དུ་རིག་པའི་རྒྱལ་པོ་འདི་ནི་སྔགས་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་བསྟན་ཅིང་ཤིན་ཏུ་གཙོ་བོ་ཡིན་ཏེ།
en: Just as Lord Buddha, O divine youth, is the most eminent person among gods and men , so he—this supreme vidyārāja —is among all the mantras.
